app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 4], ["updated_at", "2018-10-25 23:18:10.430378"], ["id", 3]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)